MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ1024GB610/mcu.h
extern volatile IPC17BITS IPC17bits __attribute__((__sfr__));

#define IPC18 IPC18
extern volatile uint16_t IPC18 __attribute__((__sfr__));
__extension__ typedef struct tagIPC18BITS {
  union {
    struct {
      uint16_t LVDIP:3;
      uint16_t :1;
      uint16_t CCP7IP:3;
    };
    struct {
      uint16_t LVDIP0:1;
      uint16_t LVDIP1:1;
      uint16_t LVDIP2:1;
      uint16_t :1;
      uint16_t CCP7IP0:1;
      uint16_t CCP7IP1:1;
      uint16_t CCP7IP2:1;
    };
  };
} IPC18BITS;
extern volatile IPC18BITS IPC18bits __attribute__((__sfr__));

#define IPC19 IPC19
extern volatile uint16_t IPC19 __attribute__((__sfr__));
__extension__ typedef struct tagIPC19BITS {
  union {
    struct {
      uint16_t :4;
      uint16_t CTMUIP:3;
    };
    struct {
      uint16_t :4;
      uint16_t CTMUIP0:1;
      uint16_t CTMUIP1:1;
      uint16_t CTMUIP2:1;
    };
  };
} IPC19BITS;
extern volatile IPC19BITS IPC19bits __attribute__((__sfr__));

#define IPC20 IPC20
extern volatile uint16_t IPC20 __attribute__((__sfr__));
__extension__ typedef struct tagIPC20BITS {
  union {
    struct {
      uint16_t :4;
      uint16_t U3ERIP:3;
      uint16_t :1;
      uint16_t U3RXIP:3;
      uint16_t :1;
      uint16_t U3TXIP:3;
    };
    struct {
      uint16_t :4;
      uint16_t U3ERIP0:1;
      uint16_t U3ERIP1:1;
      uint16_t U3ERIP2:1;
      uint16_t :1;
      uint16_t U3RXIP0:1;
      uint16_t U3RXIP1:1;
      uint16_t U3RXIP2:1;
      uint16_t :1;
      uint16_t U3TXIP0:1;
      uint16_t U3TXIP1:1;
      uint16_t U3TXIP2:1;
    };
  };
} IPC20BITS;
extern volatile IPC20BITS IPC20bits __attribute__((__sfr__));

#define IPC21 IPC21
extern volatile uint16_t IPC21 __attribute__((__sfr__));
__extension__ typedef struct tagIPC21BITS {
  union {
    struct {
      uint16_t I2C1BCIP:3;
      uint16_t :1;
      uint16_t I2C2BCIP:3;
      uint16_t :1;
      uint16_t USB1IP:3;
      uint16_t :1;
      uint16_t U4ERIP:3;
    };
    struct {
      uint16_t :8;
      uint16_t USB1IP0:1;
      uint16_t USB1IP1:1;
      uint16_t USB1IP2:1;
      uint16_t :1;
      uint16_t U4ERIP0:1;
      uint16_t U4ERIP1:1;
      uint16_t U4ERIP2:1;
    };
  };
} IPC21BITS;
extern volatile IPC21BITS IPC21bits __attribute__((__sfr__));

#define IPC22 IPC22
extern volatile uint16_t IPC22 __attribute__((__sfr__));
__extension__ typedef struct tagIPC22BITS {
  union {
    struct {
      uint16_t U4RXIP:3;
      uint16_t :1;
      uint16_t U4TXIP:3;
      uint16_t :1;
      uint16_t SPI3IP:3;
      uint16_t :1;
      uint16_t SPI3TXIP:3;
    };
    struct {
      uint16_t U4RXIP0:1;
      uint16_t U4RXIP1:1;
      uint16_t U4RXIP2:1;
      uint16_t :1;
      uint16_t U4TXIP0:1;
      uint16_t U4TXIP1:1;
      uint16_t U4TXIP2:1;
      uint16_t :1;
      uint16_t SPI3IP0:1;
      uint16_t SPI3IP1:1;
      uint16_t SPI3IP2:1;
      uint16_t :1;
      uint16_t SPI3TXIP0:1;
      uint16_t SPI3TXIP1:1;
      uint16_t SPI3TXIP2:1;
    };
  };
} IPC22BITS;
extern volatile IPC22BITS IPC22bits __attribute__((__sfr__));

#define IPC23 IPC23
extern volatile uint16_t IPC23 __attribute__((__sfr__));
__extension__ typedef struct tagIPC23BITS {
  union {
    struct {
      uint16_t :8;
      uint16_t CCP3IP:3;
      uint16_t :1;
      uint16_t CCP4IP:3;
    };
    struct {
      uint16_t :8;
      uint16_t CCP3IP0:1;
      uint16_t CCP3IP1:1;
      uint16_t CCP3IP2:1;
      uint16_t :1;
      uint16_t CCP4IP0:1;
      uint16_t CCP4IP1:1;
      uint16_t CCP4IP2:1;
    };
  };
} IPC23BITS;
extern volatile IPC23BITS IPC23bits __attribute__((__sfr__));

#define IPC24 IPC24
extern volatile uint16_t IPC24 __attribute__((__sfr__));
__extension__ typedef struct tagIPC24BITS {
  union {
    struct {
      uint16_t CLC1IP:3;
      uint16_t :1;
      uint16_t CLC2IP:3;
      uint16_t :1;
      uint16_t CLC3IP:3;
      uint16_t :1;
      uint16_t CLC4IP:3;
    };
    struct {
      uint16_t CLC1IP0:1;
      uint16_t CLC1IP1:1;
      uint16_t CLC1IP2:1;
      uint16_t :1;
      uint16_t CLC2IP0:1;
      uint16_t CLC2IP1:1;
      uint16_t CLC2IP2:1;
      uint16_t :1;
      uint16_t CLC3IP0:1;
      uint16_t CLC3IP1:1;
      uint16_t CLC3IP2:1;
      uint16_t :1;
      uint16_t CLC4IP0:1;
      uint16_t CLC4IP1:1;
      uint16_t CLC4IP2:1;
    };
  };
} IPC24BITS;
extern volatile IPC24BITS IPC24bits __attribute__((__sfr__));

#define IPC25 IPC25
extern volatile uint16_t IPC25 __attribute__((__sfr__));
__extension__ typedef struct tagIPC25BITS {
  union {
    struct {
      uint16_t :4;
      uint16_t CCT1IP:3;
      uint16_t :1;
      uint16_t CCT2IP:3;
    };
    struct {
      uint16_t :4;
      uint16_t CCT1IP0:1;
      uint16_t CCT1IP1:1;
      uint16_t CCT1IP2:1;
      uint16_t :1;
      uint16_t CCT2IP0:1;
      uint16_t CCT2IP1:1;
      uint16_t CCT2IP2:1;
    };
  };
} IPC25BITS;
extern volatile IPC25BITS IPC25bits __attribute__((__sfr__));

#define IPC26 IPC26
extern volatile uint16_t IPC26 __attribute__((__sfr__));
__extension__ typedef struct tagIPC26BITS {
  union {
    struct {
      uint16_t :8;
      uint16_t FSTIP:3;
    };
    struct {
      uint16_t :8;
      uint16_t FSTIP0:1;
      uint16_t FSTIP1:1;
      uint16_t FSTIP2:1;
    };
  };
} IPC26BITS;
extern volatile IPC26BITS IPC26bits __attribute__((__sfr__));

#define IPC27 IPC27
extern volatile uint16_t IPC27 __attribute__((__sfr__));
__extension__ typedef struct tagIPC27BITS {
  union {
    struct {
      uint16_t :4;
      uint16_t I2C3BCIP:3;
      uint16_t :1;
      uint16_t RTCCTSIP:3;
      uint16_t :1;
      uint16_t U5RXIP:3;
    };
    struct {
      uint16_t :4;
      uint16_t I2C3BCIP0:1;
      uint16_t I2C3BCIP1:1;
      uint16_t I2C3BCIP2:1;
      uint16_t :1;
      uint16_t RTCCTCIP0:1;
      uint16_t RTCCTSIP1:1;
      uint16_t RTCCTSIP2:1;
      uint16_t :1;
      uint16_t U5RXIP0:1;
      uint16_t U5RXIP1:1;
      uint16_t U5RXIP2:1;
    };
  };
} IPC27BITS;
extern volatile IPC27BITS IPC27bits __attribute__((__sfr__));

#define IPC28 IPC28
extern volatile uint16_t IPC28 __attribute__((__sfr__));
__extension__ typedef struct tagIPC28BITS {
  union {
    struct {
      uint16_t U5TXIP:3;
      uint16_t :1;
      uint16_t U5ERIP:3;
      uint16_t :1;
      uint16_t U6RXIP:3;
      uint16_t :1;
      uint16_t U6TXIP:3;
    };
    struct {
      uint16_t U5TXIP0:1;
      uint16_t U5TXIP1:1;
      uint16_t U5TXIP2:1;
      uint16_t :1;
      uint16_t U5ERIP0:1;
      uint16_t U5ERIP1:1;
      uint16_t U5ERIP2:1;
      uint16_t :1;
      uint16_t U6RXIP0:1;
      uint16_t U6RXIP1:1;
      uint16_t U6RXIP2:1;
      uint16_t :1;
      uint16_t U6TXIP0:1;
      uint16_t U6TXIP1:1;
      uint16_t U6TXIP2:1;
    };
  };
} IPC28BITS;
extern volatile IPC28BITS IPC28bits __attribute__((__sfr__));

