MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ1024GB610/mcu.h
#define _CCP7CON3H_PSSACE0_POSITION              0x00000002
#define _CCP7CON3H_PSSACE0_MASK                  0x00000004
#define _CCP7CON3H_PSSACE0_LENGTH                0x00000001

#define _CCP7CON3H_PSSACE1_POSITION              0x00000003
#define _CCP7CON3H_PSSACE1_MASK                  0x00000008
#define _CCP7CON3H_PSSACE1_LENGTH                0x00000001

#define _CCP7CON3H_OSCNT0_POSITION               0x0000000C
#define _CCP7CON3H_OSCNT0_MASK                   0x00001000
#define _CCP7CON3H_OSCNT0_LENGTH                 0x00000001

#define _CCP7CON3H_OSCNT1_POSITION               0x0000000D
#define _CCP7CON3H_OSCNT1_MASK                   0x00002000
#define _CCP7CON3H_OSCNT1_LENGTH                 0x00000001

#define _CCP7CON3H_OSCNT2_POSITION               0x0000000E
#define _CCP7CON3H_OSCNT2_MASK                   0x00004000
#define _CCP7CON3H_OSCNT2_LENGTH                 0x00000001

#define _CCP7STAT_ICBNE_POSITION                 0x00000000
#define _CCP7STAT_ICBNE_MASK                     0x00000001
#define _CCP7STAT_ICBNE_LENGTH                   0x00000001

#define _CCP7STAT_ICOV_POSITION                  0x00000001
#define _CCP7STAT_ICOV_MASK                      0x00000002
#define _CCP7STAT_ICOV_LENGTH                    0x00000001

#define _CCP7STAT_ICDIS_POSITION                 0x00000002
#define _CCP7STAT_ICDIS_MASK                     0x00000004
#define _CCP7STAT_ICDIS_LENGTH                   0x00000001

#define _CCP7STAT_SCEVT_POSITION                 0x00000003
#define _CCP7STAT_SCEVT_MASK                     0x00000008
#define _CCP7STAT_SCEVT_LENGTH                   0x00000001

#define _CCP7STAT_ASEVT_POSITION                 0x00000004
#define _CCP7STAT_ASEVT_MASK                     0x00000010
#define _CCP7STAT_ASEVT_LENGTH                   0x00000001

#define _CCP7STAT_TRCLR_POSITION                 0x00000005
#define _CCP7STAT_TRCLR_MASK                     0x00000020
#define _CCP7STAT_TRCLR_LENGTH                   0x00000001

#define _CCP7STAT_TRSET_POSITION                 0x00000006
#define _CCP7STAT_TRSET_MASK                     0x00000040
#define _CCP7STAT_TRSET_LENGTH                   0x00000001

#define _CCP7STAT_CCPTRIG_POSITION               0x00000007
#define _CCP7STAT_CCPTRIG_MASK                   0x00000080
#define _CCP7STAT_CCPTRIG_LENGTH                 0x00000001

#define _CCP7STAT_ICGARM_POSITION                0x0000000A
#define _CCP7STAT_ICGARM_MASK                    0x00000400
#define _CCP7STAT_ICGARM_LENGTH                  0x00000001

#define _CCP7STAT_TRIG_POSITION                  0x00000007
#define _CCP7STAT_TRIG_MASK                      0x00000080
#define _CCP7STAT_TRIG_LENGTH                    0x00000001

#define _CCP7STATL_ICBNE_POSITION                0x00000000
#define _CCP7STATL_ICBNE_MASK                    0x00000001
#define _CCP7STATL_ICBNE_LENGTH                  0x00000001

#define _CCP7STATL_ICOV_POSITION                 0x00000001
#define _CCP7STATL_ICOV_MASK                     0x00000002
#define _CCP7STATL_ICOV_LENGTH                   0x00000001

#define _CCP7STATL_ICDIS_POSITION                0x00000002
#define _CCP7STATL_ICDIS_MASK                    0x00000004
#define _CCP7STATL_ICDIS_LENGTH                  0x00000001

#define _CCP7STATL_SCEVT_POSITION                0x00000003
#define _CCP7STATL_SCEVT_MASK                    0x00000008
#define _CCP7STATL_SCEVT_LENGTH                  0x00000001

#define _CCP7STATL_ASEVT_POSITION                0x00000004
#define _CCP7STATL_ASEVT_MASK                    0x00000010
#define _CCP7STATL_ASEVT_LENGTH                  0x00000001

#define _CCP7STATL_TRCLR_POSITION                0x00000005
#define _CCP7STATL_TRCLR_MASK                    0x00000020
#define _CCP7STATL_TRCLR_LENGTH                  0x00000001

#define _CCP7STATL_TRSET_POSITION                0x00000006
#define _CCP7STATL_TRSET_MASK                    0x00000040
#define _CCP7STATL_TRSET_LENGTH                  0x00000001

#define _CCP7STATL_CCPTRIG_POSITION              0x00000007
#define _CCP7STATL_CCPTRIG_MASK                  0x00000080
#define _CCP7STATL_CCPTRIG_LENGTH                0x00000001

#define _CCP7STATL_ICGARM_POSITION               0x0000000A
#define _CCP7STATL_ICGARM_MASK                   0x00000400
#define _CCP7STATL_ICGARM_LENGTH                 0x00000001

#define _CCP7STATL_TRIG_POSITION                 0x00000007
#define _CCP7STATL_TRIG_MASK                     0x00000080
#define _CCP7STATL_TRIG_LENGTH                   0x00000001

#define _CCP7STATH_RAWIP_POSITION                0x00000000
#define _CCP7STATH_RAWIP_MASK                    0x00000001
#define _CCP7STATH_RAWIP_LENGTH                  0x00000001

#define _CCP7STATH_RBWIP_POSITION                0x00000001
#define _CCP7STATH_RBWIP_MASK                    0x00000002
#define _CCP7STATH_RBWIP_LENGTH                  0x00000001

#define _CCP7STATH_TMRLWIP_POSITION              0x00000002
#define _CCP7STATH_TMRLWIP_MASK                  0x00000004
#define _CCP7STATH_TMRLWIP_LENGTH                0x00000001

#define _CCP7STATH_TMRHWIP_POSITION              0x00000003
#define _CCP7STATH_TMRHWIP_MASK                  0x00000008
#define _CCP7STATH_TMRHWIP_LENGTH                0x00000001

#define _CCP7STATH_PRLWIP_POSITION               0x00000004
#define _CCP7STATH_PRLWIP_MASK                   0x00000010
#define _CCP7STATH_PRLWIP_LENGTH                 0x00000001

#define _U1MODE_STSEL_POSITION                   0x00000000
#define _U1MODE_STSEL_MASK                       0x00000001
#define _U1MODE_STSEL_LENGTH                     0x00000001

#define _U1MODE_PDSEL_POSITION                   0x00000001
#define _U1MODE_PDSEL_MASK                       0x00000006
#define _U1MODE_PDSEL_LENGTH                     0x00000002

#define _U1MODE_BRGH_POSITION                    0x00000003
#define _U1MODE_BRGH_MASK                        0x00000008
#define _U1MODE_BRGH_LENGTH                      0x00000001

#define _U1MODE_URXINV_POSITION                  0x00000004
#define _U1MODE_URXINV_MASK                      0x00000010
#define _U1MODE_URXINV_LENGTH                    0x00000001

#define _U1MODE_ABAUD_POSITION                   0x00000005
#define _U1MODE_ABAUD_MASK                       0x00000020
#define _U1MODE_ABAUD_LENGTH                     0x00000001

#define _U1MODE_LPBACK_POSITION                  0x00000006
#define _U1MODE_LPBACK_MASK                      0x00000040
#define _U1MODE_LPBACK_LENGTH                    0x00000001

#define _U1MODE_WAKE_POSITION                    0x00000007
#define _U1MODE_WAKE_MASK                        0x00000080
#define _U1MODE_WAKE_LENGTH                      0x00000001

#define _U1MODE_UEN_POSITION                     0x00000008
#define _U1MODE_UEN_MASK                         0x00000300
#define _U1MODE_UEN_LENGTH                       0x00000002

