MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ1024GB610/mcu.h
#define _U1STAT_ENDPT2_POSITION                  0x00000006
#define _U1STAT_ENDPT2_MASK                      0x00000040
#define _U1STAT_ENDPT2_LENGTH                    0x00000001

#define _U1STAT_ENDPT3_POSITION                  0x00000007
#define _U1STAT_ENDPT3_MASK                      0x00000080
#define _U1STAT_ENDPT3_LENGTH                    0x00000001

#define _U1CON_USBEN_POSITION                    0x00000000
#define _U1CON_USBEN_MASK                        0x00000001
#define _U1CON_USBEN_LENGTH                      0x00000001

#define _U1CON_PPBRST_POSITION                   0x00000001
#define _U1CON_PPBRST_MASK                       0x00000002
#define _U1CON_PPBRST_LENGTH                     0x00000001

#define _U1CON_RESUME_POSITION                   0x00000002
#define _U1CON_RESUME_MASK                       0x00000004
#define _U1CON_RESUME_LENGTH                     0x00000001

#define _U1CON_HOSTEN_POSITION                   0x00000003
#define _U1CON_HOSTEN_MASK                       0x00000008
#define _U1CON_HOSTEN_LENGTH                     0x00000001

#define _U1CON_USBRST_POSITION                   0x00000004
#define _U1CON_USBRST_MASK                       0x00000010
#define _U1CON_USBRST_LENGTH                     0x00000001

#define _U1CON_PKTDIS_POSITION                   0x00000005
#define _U1CON_PKTDIS_MASK                       0x00000020
#define _U1CON_PKTDIS_LENGTH                     0x00000001

#define _U1CON_SE0_POSITION                      0x00000006
#define _U1CON_SE0_MASK                          0x00000040
#define _U1CON_SE0_LENGTH                        0x00000001

#define _U1CON_JSTATE_POSITION                   0x00000007
#define _U1CON_JSTATE_MASK                       0x00000080
#define _U1CON_JSTATE_LENGTH                     0x00000001

#define _U1CON_SOFEN_POSITION                    0x00000000
#define _U1CON_SOFEN_MASK                        0x00000001
#define _U1CON_SOFEN_LENGTH                      0x00000001

#define _U1CON_RESET_POSITION                    0x00000004
#define _U1CON_RESET_MASK                        0x00000010
#define _U1CON_RESET_LENGTH                      0x00000001

#define _U1CON_TOKBUSY_POSITION                  0x00000005
#define _U1CON_TOKBUSY_MASK                      0x00000020
#define _U1CON_TOKBUSY_LENGTH                    0x00000001

#define _U1ADDR_ADDR_POSITION                    0x00000000
#define _U1ADDR_ADDR_MASK                        0x0000007F
#define _U1ADDR_ADDR_LENGTH                      0x00000007

#define _U1ADDR_LSPDEN_POSITION                  0x00000007
#define _U1ADDR_LSPDEN_MASK                      0x00000080
#define _U1ADDR_LSPDEN_LENGTH                    0x00000001

#define _U1ADDR_DEVADDR0_POSITION                0x00000000
#define _U1ADDR_DEVADDR0_MASK                    0x00000001
#define _U1ADDR_DEVADDR0_LENGTH                  0x00000001

#define _U1ADDR_DEVADDR1_POSITION                0x00000001
#define _U1ADDR_DEVADDR1_MASK                    0x00000002
#define _U1ADDR_DEVADDR1_LENGTH                  0x00000001

#define _U1ADDR_DEVADDR2_POSITION                0x00000002
#define _U1ADDR_DEVADDR2_MASK                    0x00000004
#define _U1ADDR_DEVADDR2_LENGTH                  0x00000001

#define _U1ADDR_DEVADDR3_POSITION                0x00000003
#define _U1ADDR_DEVADDR3_MASK                    0x00000008
#define _U1ADDR_DEVADDR3_LENGTH                  0x00000001

#define _U1ADDR_DEVADDR4_POSITION                0x00000004
#define _U1ADDR_DEVADDR4_MASK                    0x00000010
#define _U1ADDR_DEVADDR4_LENGTH                  0x00000001

#define _U1ADDR_DEVADDR5_POSITION                0x00000005
#define _U1ADDR_DEVADDR5_MASK                    0x00000020
#define _U1ADDR_DEVADDR5_LENGTH                  0x00000001

#define _U1ADDR_DEVADDR6_POSITION                0x00000006
#define _U1ADDR_DEVADDR6_MASK                    0x00000040
#define _U1ADDR_DEVADDR6_LENGTH                  0x00000001

#define _U1ADDR_LOWSPDEN_POSITION                0x00000007
#define _U1ADDR_LOWSPDEN_MASK                    0x00000080
#define _U1ADDR_LOWSPDEN_LENGTH                  0x00000001

#define _U1ADDR_ADDR0_POSITION                   0x00000000
#define _U1ADDR_ADDR0_MASK                       0x00000001
#define _U1ADDR_ADDR0_LENGTH                     0x00000001

#define _U1ADDR_ADDR1_POSITION                   0x00000001
#define _U1ADDR_ADDR1_MASK                       0x00000002
#define _U1ADDR_ADDR1_LENGTH                     0x00000001

#define _U1ADDR_ADDR2_POSITION                   0x00000002
#define _U1ADDR_ADDR2_MASK                       0x00000004
#define _U1ADDR_ADDR2_LENGTH                     0x00000001

#define _U1ADDR_ADDR3_POSITION                   0x00000003
#define _U1ADDR_ADDR3_MASK                       0x00000008
#define _U1ADDR_ADDR3_LENGTH                     0x00000001

#define _U1ADDR_ADDR4_POSITION                   0x00000004
#define _U1ADDR_ADDR4_MASK                       0x00000010
#define _U1ADDR_ADDR4_LENGTH                     0x00000001

#define _U1ADDR_ADDR5_POSITION                   0x00000005
#define _U1ADDR_ADDR5_MASK                       0x00000020
#define _U1ADDR_ADDR5_LENGTH                     0x00000001

#define _U1ADDR_ADDR6_POSITION                   0x00000006
#define _U1ADDR_ADDR6_MASK                       0x00000040
#define _U1ADDR_ADDR6_LENGTH                     0x00000001

#define _U1ADDR_DEVADDR_POSITION                 0x00000000
#define _U1ADDR_DEVADDR_MASK                     0x0000007F
#define _U1ADDR_DEVADDR_LENGTH                   0x00000007

#define _U1BDTP1_BDTPTRL_POSITION                0x00000001
#define _U1BDTP1_BDTPTRL_MASK                    0x000000FE
#define _U1BDTP1_BDTPTRL_LENGTH                  0x00000007

#define _U1BDTP1_BDTPTRL0_POSITION               0x00000001
#define _U1BDTP1_BDTPTRL0_MASK                   0x00000002
#define _U1BDTP1_BDTPTRL0_LENGTH                 0x00000001

#define _U1BDTP1_BDTPTRL1_POSITION               0x00000002
#define _U1BDTP1_BDTPTRL1_MASK                   0x00000004
#define _U1BDTP1_BDTPTRL1_LENGTH                 0x00000001

#define _U1BDTP1_BDTPTRL2_POSITION               0x00000003
#define _U1BDTP1_BDTPTRL2_MASK                   0x00000008
#define _U1BDTP1_BDTPTRL2_LENGTH                 0x00000001

#define _U1BDTP1_BDTPTRL3_POSITION               0x00000004
#define _U1BDTP1_BDTPTRL3_MASK                   0x00000010
#define _U1BDTP1_BDTPTRL3_LENGTH                 0x00000001

#define _U1BDTP1_BDTPTRL4_POSITION               0x00000005
#define _U1BDTP1_BDTPTRL4_MASK                   0x00000020
#define _U1BDTP1_BDTPTRL4_LENGTH                 0x00000001

#define _U1BDTP1_BDTPTRL5_POSITION               0x00000006
#define _U1BDTP1_BDTPTRL5_MASK                   0x00000040
#define _U1BDTP1_BDTPTRL5_LENGTH                 0x00000001

#define _U1BDTP1_BDTPTRL6_POSITION               0x00000007
#define _U1BDTP1_BDTPTRL6_MASK                   0x00000080
#define _U1BDTP1_BDTPTRL6_LENGTH                 0x00000001

#define _U1FRML_FRM0_POSITION                    0x00000000
#define _U1FRML_FRM0_MASK                        0x00000001
#define _U1FRML_FRM0_LENGTH                      0x00000001

#define _U1FRML_FRM1_POSITION                    0x00000001
#define _U1FRML_FRM1_MASK                        0x00000002
#define _U1FRML_FRM1_LENGTH                      0x00000001

#define _U1FRML_FRM2_POSITION                    0x00000002
#define _U1FRML_FRM2_MASK                        0x00000004
#define _U1FRML_FRM2_LENGTH                      0x00000001

