MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ1024GB610/mcu.h
#define _CNPUA_IOCPA2_POSITION                   0x00000002
#define _CNPUA_IOCPA2_MASK                       0x00000004
#define _CNPUA_IOCPA2_LENGTH                     0x00000001

#define _CNPUA_IOCPA3_POSITION                   0x00000003
#define _CNPUA_IOCPA3_MASK                       0x00000008
#define _CNPUA_IOCPA3_LENGTH                     0x00000001

#define _CNPUA_IOCPA4_POSITION                   0x00000004
#define _CNPUA_IOCPA4_MASK                       0x00000010
#define _CNPUA_IOCPA4_LENGTH                     0x00000001

#define _CNPUA_IOCPA5_POSITION                   0x00000005
#define _CNPUA_IOCPA5_MASK                       0x00000020
#define _CNPUA_IOCPA5_LENGTH                     0x00000001

#define _CNPUA_IOCPA6_POSITION                   0x00000006
#define _CNPUA_IOCPA6_MASK                       0x00000040
#define _CNPUA_IOCPA6_LENGTH                     0x00000001

#define _CNPUA_IOCPA7_POSITION                   0x00000007
#define _CNPUA_IOCPA7_MASK                       0x00000080
#define _CNPUA_IOCPA7_LENGTH                     0x00000001

#define _CNPUA_IOCPA9_POSITION                   0x00000009
#define _CNPUA_IOCPA9_MASK                       0x00000200
#define _CNPUA_IOCPA9_LENGTH                     0x00000001

#define _CNPUA_IOCPA10_POSITION                  0x0000000A
#define _CNPUA_IOCPA10_MASK                      0x00000400
#define _CNPUA_IOCPA10_LENGTH                    0x00000001

#define _CNPUA_IOCPA14_POSITION                  0x0000000E
#define _CNPUA_IOCPA14_MASK                      0x00004000
#define _CNPUA_IOCPA14_LENGTH                    0x00000001

#define _CNPUA_IOCPA15_POSITION                  0x0000000F
#define _CNPUA_IOCPA15_MASK                      0x00008000
#define _CNPUA_IOCPA15_LENGTH                    0x00000001

#define _CNPUA_IOCPUA0_POSITION                  0x00000000
#define _CNPUA_IOCPUA0_MASK                      0x00000001
#define _CNPUA_IOCPUA0_LENGTH                    0x00000001

#define _CNPUA_IOCPUA1_POSITION                  0x00000001
#define _CNPUA_IOCPUA1_MASK                      0x00000002
#define _CNPUA_IOCPUA1_LENGTH                    0x00000001

#define _CNPUA_IOCPUA2_POSITION                  0x00000002
#define _CNPUA_IOCPUA2_MASK                      0x00000004
#define _CNPUA_IOCPUA2_LENGTH                    0x00000001

#define _CNPUA_IOCPUA3_POSITION                  0x00000003
#define _CNPUA_IOCPUA3_MASK                      0x00000008
#define _CNPUA_IOCPUA3_LENGTH                    0x00000001

#define _CNPUA_IOCPUA4_POSITION                  0x00000004
#define _CNPUA_IOCPUA4_MASK                      0x00000010
#define _CNPUA_IOCPUA4_LENGTH                    0x00000001

#define _CNPUA_IOCPUA5_POSITION                  0x00000005
#define _CNPUA_IOCPUA5_MASK                      0x00000020
#define _CNPUA_IOCPUA5_LENGTH                    0x00000001

#define _CNPUA_IOCPUA6_POSITION                  0x00000006
#define _CNPUA_IOCPUA6_MASK                      0x00000040
#define _CNPUA_IOCPUA6_LENGTH                    0x00000001

#define _CNPUA_IOCPUA7_POSITION                  0x00000007
#define _CNPUA_IOCPUA7_MASK                      0x00000080
#define _CNPUA_IOCPUA7_LENGTH                    0x00000001

#define _CNPUA_IOCPUA9_POSITION                  0x00000009
#define _CNPUA_IOCPUA9_MASK                      0x00000200
#define _CNPUA_IOCPUA9_LENGTH                    0x00000001

#define _CNPUA_IOCPUA10_POSITION                 0x0000000A
#define _CNPUA_IOCPUA10_MASK                     0x00000400
#define _CNPUA_IOCPUA10_LENGTH                   0x00000001

#define _CNPUA_IOCPUA14_POSITION                 0x0000000E
#define _CNPUA_IOCPUA14_MASK                     0x00004000
#define _CNPUA_IOCPUA14_LENGTH                   0x00000001

#define _CNPUA_IOCPUA15_POSITION                 0x0000000F
#define _CNPUA_IOCPUA15_MASK                     0x00008000
#define _CNPUA_IOCPUA15_LENGTH                   0x00000001

#define _CNPUA_CNPUA0_POSITION                   0x00000000
#define _CNPUA_CNPUA0_MASK                       0x00000001
#define _CNPUA_CNPUA0_LENGTH                     0x00000001

#define _CNPUA_CNPUA1_POSITION                   0x00000001
#define _CNPUA_CNPUA1_MASK                       0x00000002
#define _CNPUA_CNPUA1_LENGTH                     0x00000001

#define _CNPUA_CNPUA2_POSITION                   0x00000002
#define _CNPUA_CNPUA2_MASK                       0x00000004
#define _CNPUA_CNPUA2_LENGTH                     0x00000001

#define _CNPUA_CNPUA3_POSITION                   0x00000003
#define _CNPUA_CNPUA3_MASK                       0x00000008
#define _CNPUA_CNPUA3_LENGTH                     0x00000001

#define _CNPUA_CNPUA4_POSITION                   0x00000004
#define _CNPUA_CNPUA4_MASK                       0x00000010
#define _CNPUA_CNPUA4_LENGTH                     0x00000001

#define _CNPUA_CNPUA5_POSITION                   0x00000005
#define _CNPUA_CNPUA5_MASK                       0x00000020
#define _CNPUA_CNPUA5_LENGTH                     0x00000001

#define _CNPUA_CNPUA6_POSITION                   0x00000006
#define _CNPUA_CNPUA6_MASK                       0x00000040
#define _CNPUA_CNPUA6_LENGTH                     0x00000001

#define _CNPUA_CNPUA7_POSITION                   0x00000007
#define _CNPUA_CNPUA7_MASK                       0x00000080
#define _CNPUA_CNPUA7_LENGTH                     0x00000001

#define _CNPUA_CNPUA9_POSITION                   0x00000009
#define _CNPUA_CNPUA9_MASK                       0x00000200
#define _CNPUA_CNPUA9_LENGTH                     0x00000001

#define _CNPUA_CNPUA10_POSITION                  0x0000000A
#define _CNPUA_CNPUA10_MASK                      0x00000400
#define _CNPUA_CNPUA10_LENGTH                    0x00000001

#define _CNPUA_CNPUA14_POSITION                  0x0000000E
#define _CNPUA_CNPUA14_MASK                      0x00004000
#define _CNPUA_CNPUA14_LENGTH                    0x00000001

#define _CNPUA_CNPUA15_POSITION                  0x0000000F
#define _CNPUA_CNPUA15_MASK                      0x00008000
#define _CNPUA_CNPUA15_LENGTH                    0x00000001

#define _IOCPUA_IOCPA0_POSITION                  0x00000000
#define _IOCPUA_IOCPA0_MASK                      0x00000001
#define _IOCPUA_IOCPA0_LENGTH                    0x00000001

#define _IOCPUA_IOCPA1_POSITION                  0x00000001
#define _IOCPUA_IOCPA1_MASK                      0x00000002
#define _IOCPUA_IOCPA1_LENGTH                    0x00000001

#define _IOCPUA_IOCPA2_POSITION                  0x00000002
#define _IOCPUA_IOCPA2_MASK                      0x00000004
#define _IOCPUA_IOCPA2_LENGTH                    0x00000001

#define _IOCPUA_IOCPA3_POSITION                  0x00000003
#define _IOCPUA_IOCPA3_MASK                      0x00000008
#define _IOCPUA_IOCPA3_LENGTH                    0x00000001

