MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ1024GB610/mcu.h
#define _IOCPDG_IOCPDG12_POSITION                0x0000000C
#define _IOCPDG_IOCPDG12_MASK                    0x00001000
#define _IOCPDG_IOCPDG12_LENGTH                  0x00000001

#define _IOCPDG_IOCPDG13_POSITION                0x0000000D
#define _IOCPDG_IOCPDG13_MASK                    0x00002000
#define _IOCPDG_IOCPDG13_LENGTH                  0x00000001

#define _IOCPDG_IOCPDG14_POSITION                0x0000000E
#define _IOCPDG_IOCPDG14_MASK                    0x00004000
#define _IOCPDG_IOCPDG14_LENGTH                  0x00000001

#define _IOCPDG_IOCPDG15_POSITION                0x0000000F
#define _IOCPDG_IOCPDG15_MASK                    0x00008000
#define _IOCPDG_IOCPDG15_LENGTH                  0x00000001

#define _IOCPDG_CNPDG0_POSITION                  0x00000000
#define _IOCPDG_CNPDG0_MASK                      0x00000001
#define _IOCPDG_CNPDG0_LENGTH                    0x00000001

#define _IOCPDG_CNPDG1_POSITION                  0x00000001
#define _IOCPDG_CNPDG1_MASK                      0x00000002
#define _IOCPDG_CNPDG1_LENGTH                    0x00000001

#define _IOCPDG_CNPDG2_POSITION                  0x00000002
#define _IOCPDG_CNPDG2_MASK                      0x00000004
#define _IOCPDG_CNPDG2_LENGTH                    0x00000001

#define _IOCPDG_CNPDG3_POSITION                  0x00000003
#define _IOCPDG_CNPDG3_MASK                      0x00000008
#define _IOCPDG_CNPDG3_LENGTH                    0x00000001

#define _IOCPDG_CNPDG6_POSITION                  0x00000006
#define _IOCPDG_CNPDG6_MASK                      0x00000040
#define _IOCPDG_CNPDG6_LENGTH                    0x00000001

#define _IOCPDG_CNPDG7_POSITION                  0x00000007
#define _IOCPDG_CNPDG7_MASK                      0x00000080
#define _IOCPDG_CNPDG7_LENGTH                    0x00000001

#define _IOCPDG_CNPDG8_POSITION                  0x00000008
#define _IOCPDG_CNPDG8_MASK                      0x00000100
#define _IOCPDG_CNPDG8_LENGTH                    0x00000001

#define _IOCPDG_CNPDG9_POSITION                  0x00000009
#define _IOCPDG_CNPDG9_MASK                      0x00000200
#define _IOCPDG_CNPDG9_LENGTH                    0x00000001

#define _IOCPDG_CNPDG12_POSITION                 0x0000000C
#define _IOCPDG_CNPDG12_MASK                     0x00001000
#define _IOCPDG_CNPDG12_LENGTH                   0x00000001

#define _IOCPDG_CNPDG13_POSITION                 0x0000000D
#define _IOCPDG_CNPDG13_MASK                     0x00002000
#define _IOCPDG_CNPDG13_LENGTH                   0x00000001

#define _IOCPDG_CNPDG14_POSITION                 0x0000000E
#define _IOCPDG_CNPDG14_MASK                     0x00004000
#define _IOCPDG_CNPDG14_LENGTH                   0x00000001

#define _IOCPDG_CNPDG15_POSITION                 0x0000000F
#define _IOCPDG_CNPDG15_MASK                     0x00008000
#define _IOCPDG_CNPDG15_LENGTH                   0x00000001

#define _AD1CON1_DONE_POSITION                   0x00000000
#define _AD1CON1_DONE_MASK                       0x00000001
#define _AD1CON1_DONE_LENGTH                     0x00000001

#define _AD1CON1_SAMP_POSITION                   0x00000001
#define _AD1CON1_SAMP_MASK                       0x00000002
#define _AD1CON1_SAMP_LENGTH                     0x00000001

#define _AD1CON1_ASAM_POSITION                   0x00000002
#define _AD1CON1_ASAM_MASK                       0x00000004
#define _AD1CON1_ASAM_LENGTH                     0x00000001

#define _AD1CON1_SSRC_POSITION                   0x00000004
#define _AD1CON1_SSRC_MASK                       0x000000F0
#define _AD1CON1_SSRC_LENGTH                     0x00000004

#define _AD1CON1_FORM_POSITION                   0x00000008
#define _AD1CON1_FORM_MASK                       0x00000300
#define _AD1CON1_FORM_LENGTH                     0x00000002

#define _AD1CON1_MODE12_POSITION                 0x0000000A
#define _AD1CON1_MODE12_MASK                     0x00000400
#define _AD1CON1_MODE12_LENGTH                   0x00000001

#define _AD1CON1_DMAEN_POSITION                  0x0000000B
#define _AD1CON1_DMAEN_MASK                      0x00000800
#define _AD1CON1_DMAEN_LENGTH                    0x00000001

#define _AD1CON1_DMABM_POSITION                  0x0000000C
#define _AD1CON1_DMABM_MASK                      0x00001000
#define _AD1CON1_DMABM_LENGTH                    0x00000001

#define _AD1CON1_ADSIDL_POSITION                 0x0000000D
#define _AD1CON1_ADSIDL_MASK                     0x00002000
#define _AD1CON1_ADSIDL_LENGTH                   0x00000001

#define _AD1CON1_ADON_POSITION                   0x0000000F
#define _AD1CON1_ADON_MASK                       0x00008000
#define _AD1CON1_ADON_LENGTH                     0x00000001

#define _AD1CON1_SSRC0_POSITION                  0x00000004
#define _AD1CON1_SSRC0_MASK                      0x00000010
#define _AD1CON1_SSRC0_LENGTH                    0x00000001

#define _AD1CON1_SSRC1_POSITION                  0x00000005
#define _AD1CON1_SSRC1_MASK                      0x00000020
#define _AD1CON1_SSRC1_LENGTH                    0x00000001

#define _AD1CON1_SSRC2_POSITION                  0x00000006
#define _AD1CON1_SSRC2_MASK                      0x00000040
#define _AD1CON1_SSRC2_LENGTH                    0x00000001

#define _AD1CON1_SSRC3_POSITION                  0x00000007
#define _AD1CON1_SSRC3_MASK                      0x00000080
#define _AD1CON1_SSRC3_LENGTH                    0x00000001

#define _AD1CON1_FORM0_POSITION                  0x00000008
#define _AD1CON1_FORM0_MASK                      0x00000100
#define _AD1CON1_FORM0_LENGTH                    0x00000001

#define _AD1CON1_FORM1_POSITION                  0x00000009
#define _AD1CON1_FORM1_MASK                      0x00000200
#define _AD1CON1_FORM1_LENGTH                    0x00000001

#define _AD1CON2_ALTS_POSITION                   0x00000000
#define _AD1CON2_ALTS_MASK                       0x00000001
#define _AD1CON2_ALTS_LENGTH                     0x00000001

#define _AD1CON2_BUFM_POSITION                   0x00000001
#define _AD1CON2_BUFM_MASK                       0x00000002
#define _AD1CON2_BUFM_LENGTH                     0x00000001

#define _AD1CON2_SMPI_POSITION                   0x00000002
#define _AD1CON2_SMPI_MASK                       0x0000007C
#define _AD1CON2_SMPI_LENGTH                     0x00000005

#define _AD1CON2_BUFS_POSITION                   0x00000007
#define _AD1CON2_BUFS_MASK                       0x00000080
#define _AD1CON2_BUFS_LENGTH                     0x00000001

#define _AD1CON2_CSCNA_POSITION                  0x0000000A
#define _AD1CON2_CSCNA_MASK                      0x00000400
#define _AD1CON2_CSCNA_LENGTH                    0x00000001

#define _AD1CON2_BUFREGEN_POSITION               0x0000000B
#define _AD1CON2_BUFREGEN_MASK                   0x00000800
#define _AD1CON2_BUFREGEN_LENGTH                 0x00000001

#define _AD1CON2_NVCFG0_POSITION                 0x0000000D
#define _AD1CON2_NVCFG0_MASK                     0x00002000
#define _AD1CON2_NVCFG0_LENGTH                   0x00000001

#define _AD1CON2_PVCFG_POSITION                  0x0000000E
#define _AD1CON2_PVCFG_MASK                      0x0000C000
#define _AD1CON2_PVCFG_LENGTH                    0x00000002

#define _AD1CON2_SMPI0_POSITION                  0x00000002
#define _AD1CON2_SMPI0_MASK                      0x00000004
#define _AD1CON2_SMPI0_LENGTH                    0x00000001

#define _AD1CON2_SMPI1_POSITION                  0x00000003
#define _AD1CON2_SMPI1_MASK                      0x00000008
#define _AD1CON2_SMPI1_LENGTH                    0x00000001

#define _AD1CON2_SMPI2_POSITION                  0x00000004
#define _AD1CON2_SMPI2_MASK                      0x00000010
#define _AD1CON2_SMPI2_LENGTH                    0x00000001

#define _AD1CON2_SMPI3_POSITION                  0x00000005
#define _AD1CON2_SMPI3_MASK                      0x00000020
#define _AD1CON2_SMPI3_LENGTH                    0x00000001

#define _AD1CON2_SMPI4_POSITION                  0x00000006
#define _AD1CON2_SMPI4_MASK                      0x00000040
#define _AD1CON2_SMPI4_LENGTH                    0x00000001

